//  для тестування: приклад програми що приходить з frontEnd

module.exports = [
  {
    id: 1,
    title: "Program 1",
    description: "Колеса чавунні. Відпуск.",
    date: new Date(),
  },
  {
    T: 35,
    H: 2,
    errTime: 1,
    dTmin: -2,
    dTmax: 5,
    Y: 1,
    o: 35,
    i: 0,
    d: 0,
    u: 0,
    r: 2,
  },
  { T: 45, H: 0, Y: 20, o: 25, i: 10, d: 20, u: 30, r: 1 },
  { T: 105, H: 20, Y: 0, o: 25, i: 10, d: 20, u: 30, r: 1 },
  { T: 125, H: 0, Y: 20, o: 25, i: 10, d: 20, u: 30, r: 1 },
  { T: 450, H: 20, Y: 0, o: 25, i: 10, d: 20, u: 30, r: 1 },
  { T: 500, H: 0, Y: 20, o: 25, i: 10, d: 20, u: 30, r: 1 },
  { T: 550, H: 20, Y: 0, o: 25, i: 10, d: 20, u: 30, r: 1 },
];
