var door = {};
let addr = 5; //адрес блока ВВ в сети RS485, для облегчения изменения адреса регистров

//////////////////////////////// КВ "Цепь ослаблена.Рабочий" //////////////////////////////////////
door["chFree_1"] = {
  title: 'КВ "Цепь ослаблена. Рабочий"', //описание
  reg: `${addr}-DIO6`, // регистр состояния КВ
  alias: "6SQ1", // имя в схеме
};
//////////////////////////////// КВ "Цепь ослаблена.Аварийный" //////////////////////////////////////
door["chFree_2"] = {
  title: 'КВ "Цепь ослаблена. Аварийный"', //описание
  reg: `${addr}-DIO8`, // регистр состояния КВ
  alias: "6SQ3", // имя в схеме
};

//////////////////////////////// КВ "Дверь открыта. Рабочий" //////////////////////////////////////
door["doorOpened_1"] = {
  title: 'КВ "Дверь открыта. Рабочий"', //описание
  reg: `${addr}-DIO7`, // регистр состояния КВ
  alias: "6SQ2", // имя в схеме
};

//////////////////////////////// КВ "Дверь открыта. Рабочий" //////////////////////////////////////
door["doorOpened_2"] = {
  title: 'КВ "Дверь открыта. Аварийный"', //описание
  reg: `${addr}-DIO9`, // регистр состояния КВ
  alias: "6SQ4", // имя в схеме
};

//////////////////////////////// КВ "Дверь закрыта" //////////////////////////////////////
door["doorClosed"] = {
  title: 'КВ "Дверь закрыта."', //описание
  reg: `${addr}-DIO10`, // регистр состояния КВ
  alias: "6SQ5", // имя в схеме
};

//////////////////////////////// Кнопка. "Открыть" //////////////////////////////////////

door["openDoor"] = {
  title: "Открыть дверь", //описание
  reg: `${addr}-DIO20`, // регистр состояния КВ
  alias: "6SB1", // имя в схеме
};

//////////////////////////////// Кнопка. "Закрыть" //////////////////////////////////////

door["closeDoor"] = {
  title: "Закрыть дверь", //описание
  reg: `${addr}-DIO20`, // регистр состояния КВ
  alias: "6SB2", // имя в схеме
};

export default door;

//////////////////////////////// тестирование ////////
if (!module.main) {
  console.dir(door, { depth: 4 });
  //console.dir(new Buffer.from([15, 10, 8]), { depth: 4 });
  //util.inspect(config)
}
