let programm = [
  // 01
  {
    // ---------- carry -------------------
    type: "carry", // тип: "візок"(под)
    data: {
      action: "toFurnace",
    },
  }, //step "carry"
  // 02
  {
    // ---------- двері  -------------------
    type: "door", // тип: "двері"
    data: {
      action: "close",
    },
  }, //step "carry"
  // 03
  {
    // ---------- therm -------------------
    type: "therm", // тип: термообробка
    data: {
      taskT: 600, // *C цільова температура кроку
      heating: {
        time: 60, //min, час розігріву
        dTlow: -10, //*C нижня границя коридору температури
        dTHigh: +20, //*C верхня  границя коридору температури
        dTime: 10, // хв, помилка часу розігріву після якої виникає помилка "Час розігріву перевищено"
      },
      holding: {
        time: 30, //min
        dTlow: -5, //*C нижня границя коридору температури
        dTHigh: +5, //*C верхня  границя коридору температури
      },
    }, //data
  }, // step "heating"
  {
    // ---------- therm -------------------
    type: "therm", // тип: термообробка
    data: {
      taskT: 1000, // *C цільова температура кроку
      heating: {
        time: 80, //min, час розігріву
        dTlow: -10, //*C нижня границя коридору температури
        dTHigh: +20, //*C верхня  границя коридору температури
        dTime: 10, // хв, помилка часу розігріву після якої виникає помилка "Час розігріву перевищено"
      },
      holding: {
        time: 30, //min
        dTlow: -5, //*C нижня границя коридору температури
        dTHigh: +5, //*C верхня  границя коридору температури
      },
    }, //data
  }, // step "heating"
];
